{
	"sub_title": "Portfolio",
	"landing_page":{
		"short_desc": "Welcome to my portfolio, my name is Alexandru and I am a <u>software developer</u>.",
		"long_desc": "I am a language agnostic developer. Most of my projects were developed on the web-stack. I am quick at learning new technologies and languages, easily adaptive, flexible and have a problem-solving mindset. I like to keep an eye on frameworks and tools that eventually will support my development workflow and thus broadening my arsenal of skills and knowledge.\nMost of the web-stack projects that I have worked on required both front and backend to be developed.",
		"contact_desc": "Do you want to get in touch ? You can email me at: <a class=\"landing-email-link\" href=\"mailto:calexandru2018@pm.me\" target=\"_to\">calexandru2018@pm.me</a>."
	},
	"main_navigation_btns": {
		"projects": "Projects",
		"about_me": "About me",
		"contact": "Resume"
	},
	"projects":{
		"menu_title": "Projects",
		"skills_text": "Worked with the following languages and tools:",
		"btn_show": "About",
		"btn_close": "Close",
		"portfolio":{
			"title": "Portfolio",
			"desc": "The following project is my web portfolio. Since I had finished a Udemy course on VueJS, I decided that it was about time that I put that knowledge to good use. This was my first time project being fully developed on VueJS. This was also my first time that I have fully utilized a css pre-compilier (I had previously used in a previous project Bom2 but only to minify, uglify and add browser prefixes to the css code). This time, I managed to teach myself on how to use SASS/SCSS (which is what I always wanted to do), and I got into it rather quickly since it felt very natural. I used the Vue CLI 3 tool to quickly start with some boilerplate code, so that I could avoid the initial overhead of setting up a project from scratch, it is really much more effective to start this way. <u>This project was developed during during 2019, no business logic was implemented, apart from the PHP Mailer function.</u>",
			"skills": ["PHP Mail", "VueJS","SCSS", "Webpack", "Vue i18N", "Git"]
		},
		"bom2":{
			"title": "Bom&sup2;",
			"desc": "Bom2 (“Good squared” if translated from Portuguese) is a project that I developed for a client in Portugal. Their main business consists in selling a special sort of crepe and waffle from their food-truck, which they use to travel throughout Portugal thus reaching out to more people. They initially wanted a webpage that would fortify their on-line presence. The main goal was to, somehow, let the customers know about their previous, actual and future locations, so that all customers could easily find them. <br/>I firstly came up with an idea of a moving car, showing their travel progress, but that did not seem to be feasible later down the development road. We then talked and came to the conclusion that a simple but intuitive calendar-like tool could be implemented, which the client could personally insert the from-to dates and the exact coordinates (longitude and latitude) from the admin page, enabling this way the for the customers to simply click on the event withing the calendar on the webpage and be redirected to the google maps website with a suggested road (Google Maps API). I also managed to work a bit with the Instagram API so that they could choose which posts they wanted to show through a custom hashtag, that though proved to be difficult since the token expired rather often. To resolve this, I created a special button/function that allows the client to generate a new token whenever the old one expires. <br/>Most of the code is written in ES6 (arrow functions and fetch API) which I then used Babel in conjunction with Webpack to transpile code to older js. <u>This project was developed during late 2018 and beginning of 2019, has both front and back-end. Front-end was developed only as a mobile version.</u>",
			"skills": ["PHP","PHP Mail","JS5/6","HTML/CSS","Webpack","Instagram API", "Google Maps API","Git"]
		},
		"lkproperties":{
			"title": "Lk Properties",
			"desc": "This project was developed for a client located in Portugal, that wanted to be able to post real-estate for buy, rent and sale. I had conducted multiple interviews with the client so that I could gather all the necessary requirements for the project. Primarly the client was mostly interested in having a adming page so that all necessary information could be inserterted independently. For this to be accomplished, I had planned, designed and built the database in such way that it flexible and it could accomodate multiple languages (since this was another of the clients requests). The client also expressed the need of a \"create account\" functionality for the end-users. Even though such a functionality would be great to implement, I advised the client that such implementation at this point is unnecessary since the UI will permit the customer to easily get in contact in case they are interested, and that we could perhaps prioritize other areas instead. This was my first time building a large-scale webpage and also my first time using bootstrap and git. <u>This project was developed in 2018 during a couple of months, has both front and back-end which is rather complex.</u>",
			"skills": ["PHP","PHP Mail","JS/jQuery","HTML/CSS","Bootstrap","Git"]
		},
		"projekt":{
			"title": "Group Project",
			"desc": "This was a group project that me and 3 other classmates have developed at the end of our first year of university. The idea was to develop a webpage where people could easily find other people that wanted to train (be it football, gym or other types of sports). We have developed this project during one month, on which we had also to create a PP presentation of the project. The project has a front and back-end. The front-end was developed by most of us while the back-end I had personally developed it. Since only one other member had previous programming experience (and our ambitions were big), we tried to make the page as functional as possible (in terms of functions that were offered), while ignoring a bit  the design and layout since it was mostly a proof-of-concept. We had then presented our work in front of 3 teachers. During and after the presentation all teachers were surprised by our achievement since we had almost fully developed a functional web-page. Apart from finding people to train in real-time with jQuery, we also managed to make it work so that a user could edit his preferences, send “Buddy” requests and chat with other people. <u>This project was developed during the last semester month in 2018.</u>",
			"skills": ["PHP","JS/jQuery","HTML/CSS","Git"]
		},
		"vartan":{
			"title": "Värtan IK - B",
			"desc": "This was a hobby project that had I developed during the time I played football for a football team and was also a partial coach. Me and another coach planned our training sessions based on the amount of people that would join the trainings. We sometimes planned a training for 15 people and only 8 joined and vice-versa. It was a bit frustrating trying to organize something without roughly knowing how many people would show up. <br/>Since not everybody in our team had a facebook account to join a facebook-group and let us (the coaches) if they were attending the training session or not, I came up with the idea of making a simple webpage so that every member of our team could have a way to let us know if they were attending the training session or not. This in turn helped us (coaches) to better plan our training sessions and even enjoy them. <u>This project was developed in 2014, has both front and back-end.</u>",
			"read_more": "",
			"skills": ["PHP","JS","HTML/CSS","jQuery"]
		}
	},
	"about_me":{
		"menu_title": "About me",
		"p1": "I am a language agnostic developer. Most of my projects were developed on the web-stack. I am quick at learning new technologies and languages, easily adaptive, flexible and have a problem-solving mindset. I like to keep an eye on frameworks and tools that eventually will support my development workflow and thus broadening my arsenal of skills and knowledge.\nMost of the web-stack projects that I have worked on required both front and backend to be developed.",
		"p2": "I started my programming journey in high-school and since then I have been constantly developing my skills.",
		"p3": "At the end of my last high-school year I got a 3 month internship (which was part of the high-school curriculum) in a web-development/design/marketing company called World Wide Design, located in Portugal. I was one of the three apprentices back then. At the moment I am studying IS Development at the university of Uppsala, Sweden.",
		"p4": "Worked with the following languages:",
		"p5": "Worked with the following libraries, frameworks and tools:"
	},
	"contact": {
		"menu_title": "Contact",
		"menu_text": "You can either email me at <a class=\"landing-email-link\" href=\"mailto:calexandru2018@pm.me\" target=\"_top\">calexandru2018@pm.me</a>.",
		"contact_form":{
			"confirm_sent": "Sent",
			"error_sent": "Error sending",
			"send_btn": "Send"
		}
	}
}