{
	"sub_title": "Portfólio",
	"landing_page":{
		"short_desc": "Bem-vindo ao portfólio, chamo-me Alexandru e sou um <u>desenvolvedor de software.</u>",
		"long_desc": "Sou um desenvolvedor agnóstico de linguagem. A maioria dos meus projetos foram desenvolvidos no web-stack. Tenho facilidade em aprender novas tecnologias e linguagens,sou facilmente adaptável, flexível e tenho uma mentalidade de resolução de problemas. Gosto de me manter a par nas frameworks e ferramentas que eventualmente darão suporte ao meu fluxo de trabalho de desenvolvimento e, assim, aumentar as minhas habilidades e conhecimento geral. A maioria dos projetos de web-stack em que trabalhei exigiam que tanto o front como o back-end fossem desenvolvidos.",
		"contact_desc": "Deseja entrar em contato comigo? Envie um email para: <a class=\"landing-email-link\" href=\"mailto:calexandru2018@pm.me\" target=\"_to\">calexandru2018@pm.me</a>."
	},
	"main_navigation_btns": {
		"projects": "Projectos",
		"about_me": "Sobre mim",
		"contact": "Currículo"
	},
	"projects":{
		"menu_title": "Projectos",
		"skills_text": "Trabalhei com as seguintes línguas e ferramentas:",
		"btn_show": "Sobre",
		"btn_close": "Fechar",
		"portfolio":{
			"title": "Portfólio",
			"desc": "O seguinte projeto é o meu porfolio web. Desde que terminei o curso da Udemy em VueJS, decidi que já era hora de dar bom uso a esse conhecimento. Este foi o meu primeiro projeto a ser totalmente desenvolvido em VueJS, esta foi também a primeira vez que utilizei um pré-compilador css (utilizei-o num projeto anterior, Bom2, mas apenas para minimizar, “uglify” e adicionar prefixos de navegador ao código css). Desta vez, aprendi como usar o SASS/SCSS (algo que eu sempre quis fazer) e realmente aprendi-o bastante rápido, pois a lógica de programação é semelhante à outras línugas. Usei a ferramenta Vue CLI 3 para começar rapidamente com algum código padrão, para assim, evitar a sobrecarga inicial de começar um projeto a partir do zero (é realmente muito mais eficaz começar desta forma). <u>Este projeto foi desenvolvido em 2019, nenhuma “business logic” foi implementada.</u>",
			"skills": ["VueJS","SCSS", "Webpack", "Vue i18N", "Git"]
		},
		"bom2":{
			"title": "Bom&sup2",
			"desc": "Bom2 (lê-se Bom ao Quadrado) é um projeto que desenvolvi para um cliente em Portugal. O seu negócio principal consiste em vender um tipo especial de crepe e waffle numa food truck, que utilizam para viajar por todo o país e assim alcançar mais pessoas. Inicialmente, queriam uma página Web que fortalecesse a sua presença online. O objetivo principal era, de alguma forma, dar a conhecer as suas localizações anteriores, atuais e futuras, para que os clientes pudessem encontrá-los facilmente. Primeiramente tive a ideia de um carro em movimento que mostrava o progresso da viagem, mas isso não mostrou ser viável quando comecei com o desenvolvimento da página. Conversei com o responsável e chegamos à conclusão de que era possível implementar uma ferramenta simples, porém intuitiva, semelhante a um calendário na qual o cliente poderia inserir pessoalmente as datas, num estilo de evento, e as coordenadas exatas (longitude e latitude) numa página própria que somente a administração teria acesso, permitindo assim que os clientes simplesmente clicassem no evento com o calendário da página Web e fossem redirecionados para o website do Google Maps com uma estrada sugerida (Google Maps API). Consegui, também, trabalhar um pouco com a API do Instagram para que eles pudessem escolher quais os posts que gostavam de mostrar através de um hashtag personalizado, o que provou ser bastante complicado uma vez que o token expirava com bastante frequência. Para resolver este problema, criei um/a botão/função especial que permite ao cliente gerar um novo token sempre que o antigo expira. Grande parte do código usado nesta página é escrito em ES6 (funções de seta e API de busca), usando Babel em conjunto com o Webpack para transportar o código para JS mais antigo (ES5). <u>Este projeto foi desenvolvido no final de 2018 e início de 2019, tem front e back-end. O front-end foi otimizado apenas para a versão de telemóvel.</u>",
			"skills": ["PHP","PHP Mail","JS5/6","HTML/CSS","Webpack","Instagram API", "Google Maps API","Git"]
		},
		"lkproperties":{
			"title": "Lk Properties",
			"desc": "Este projeto foi desenvolvido para um cliente em Portugal, que pretendia colocar imóveis para compra, aluguer e venda. Realizei várias entrevistas com o cliente para reunir todos os requisitos necessários para o projeto. Principalmente, o cliente estava mais interessado em ter uma página de anúncios para que toda a informação necessária pudesse ser inserida de forma independente. Para que isso fosse possível, eu tinha planeado, projetado e construído a base de dados de forma que fosse flexível e que pudesse acomodar vários idiomas (já que esse era outro dos pedidos do cliente). O cliente também expressou a necessidade de uma funcionalidade tipo \"criar conta\" para os utilizadores finais. Embora esta funcionalidade seja ótima para a retenção de utilizadores, eu recomendei ao cliente que tal implementação seria desnecessária no momento, pois a interface permitirá que o utilizador entre facilmente em contacto caso esteja interessado, e que talvez devessemos dar prioridade a outros aspectos do projeto. Esta foi a primeira vez que criei uma página da web em grande escala e também foi a primeira vez a usar o bootstrap e o git. <u>Este projeto foi desenvolvido durante alguns meses em 2018 e possui front e back-end, que é bastante complexo.</u>",
			"skills": ["PHP","PHP Mail","JS/jQuery","HTML/CSS","Bootstrap","Git"]
		},
		"projekt":{
			"title": "Group Project",
			"desc": "Este foi um projeto de grupo que eu e mais três colegas desenvolvemos no final do nosso primeiro ano de universidade. A ideia era desenvolver uma página web onde as pessoas pudessem facilmente encontrar outras pessoas que queriam treinar em conjunto (seja futebol, ginásio ou outro tipo de desporto). Desenvolvemos este projeto durante um mês, no qual também tivemos que criar uma apresentação PP (PowerPoint) do projeto. O projeto tem um front e back-end. O front-end foi desenvolvido pela maioria do grupo, enquanto que o back-end foi desenvolvido por mim. Como apenas um outro membro do grupo possuía experiência em programação, e como tínhamos grandes ambições, tentámos tornar a página o mais funcional possível (em termos das funções que eram oferecidas), ignorando um pouco o design e o layout uma vez que o resultado era uma prova de conceito. Apresentámos, de seguida, o nosso trabalho a três professores. Durante e depois da apresentação todos os professores ficaram surpreendidos com o nosso desempenho, uma vez que tínhamos desenvolvido quase totalmente uma página da web e que também era funcional. Para além de permitir ao utilizador encontrar pessoas para treinar em tempo real (realizador através de jQuery), também conseguimos permitir para que um utilizador pudesse editar as suas preferências, enviar pedidos de \"amizade\" e conversar com outras pessoas. <u>Este projeto foi desenvolvido durante o último semestre de 2018.</u>",
			"skills": ["PHP","JS/jQuery","HTML/CSS","Git"]
		},
		"vartan":{
			"title": "Värtan IK - B",
			"desc": "Este foi um projeto hobby que eu desenvolvi durante o tempo em que jogava futebol e era, também, treinador parcial (nada de muito sério). Eu e outro treinador planeávamos as nossas sessões de treino com base na quantidade de pessoas que iriam participar. Por vezes, planeávamos um treino para 15 pessoas e apenas 8 apareciam e vice-versa. Era um bocado frustrante tentar organizar algo sem saber aproximadamente quantas pessoas iriam aparecer. Como nem todos na nossa equipa tinham uma conta no Facebook para se juntarem a um grupo lá criado, e assim, darem-nos (treinadores) a conhecer se iriam ou não participar no treino, tive a ideia de criar uma página web para que cada membro da equipa pudesse ter uma forma de nos informar se iriam ou não a participar na sessão de treino. Isto, por sua vez, ajudou-nos (treinadores) a planear melhor as nossas sessões de treino. <u>Este projeto foi desenvolvido em 2014, tem tanto front como back-end.</u>",
			"read_more": "",
			"skills": ["PHP","JS","HTML/CSS","jQuery"]
		}
	},
	"about_me":{
		"menu_title": "Sobre mim",
		"p1": "Sou um desenvolvedor agnóstico de linguagem. A maioria dos meus projetos foram desenvolvidos no web-stack. Tenho facilidade em aprender novas tecnologias e linguagens,sou facilmente adaptável, flexível e tenho uma mentalidade de resolução de problemas. Gosto de me manter a par nas frameworks e ferramentas que eventualmente darão suporte ao meu fluxo de trabalho de desenvolvimento e, assim, aumentar as minhas habilidades e conhecimento geral. A maioria dos projetos de web-stack em que trabalhei exigiam que tanto o front como o back-end fossem desenvolvidos.",
		"p2": "Comecei a minha jornada dentro da área de programação no ensino secundário e, desde então,  que tenho desenvolvido constantemente as minhas habilidades nesta área.",
		"p3": "No final do meu último ano de secundário fiz um estágio de 3 meses, pois fazia parte do currículo escolar, numa empresa de desenvolvimento, design e marketing chamada World Wide Design, localizada em Portugal. Na altura, eu era um dos 3 aprendizes dentro da área de desenvolvimento web. Neste momento estou a estudar Desenvolvimento de SI, na Universidade de Uppsala, na Suécia.",
		"p4": "Trabalhei com as seguintes linguagens de programação:",
		"p5": "Trabalhei com as seguintes bibliotecas, frameworks e ferramentas:"
	},
	"contact": {
		"menu_title": "Contacto",
		"menu_text": "Pode-me enviar um email através para: <a class=\"landing-email-link\" href=\"mailto:calexandru2018@pm.me\" target=\"_top\">calexandru2018@pm.me</a>.",
		"contact_form":{
			"confirm_sent": "Enviado",
			"error_sent": "Error ao enviar",
			"send_btn": "Enviar"
		}
	}
}