{
	"sub_title": "Portfólio",
	"landing_page":{
		"short_desc": "Bem-vindo ao portfólio, chamo-me Alexandru e sou um <u>desenvolvedor de software</u>.",
		"long_desc": "Sou desenvolvedor independente de idioma. A maioria dos meus projetos foi desenvolvida na pilha da web. Sou rápido em aprender novas tecnologias e idiomas, facilmente adaptável, flexível e tenho uma mentalidade de solução de problemas. Gosto de ficar de olho nas estruturas e ferramentas que eventualmente apoiarão meu fluxo de trabalho de desenvolvimento e, assim, ampliarão meu arsenal de habilidades e conhecimentos.\nA maioria dos projetos de pilha da web em que trabalhei exigiram o desenvolvimento de front-end e back-end.",
		"contact_desc": "Deseja entrar em contato comigo? Envie um email para: <a class=\"landing-email-link\" href=\"mailto:calexandru2018@pm.me\" target=\"_to\">calexandru2018@pm.me</a>."
	},
	"main_navigation_btns": {
		"projects": "Projectos",
		"about_me": "Sobre mim",
		"contact": "Currículo"
	},
	"projects":{
		"menu_title": "Projectos",
		"skills_text": "Trabalhei com as seguintes línguas e ferramentas:",
		"btn_show": "Sobre",
		"btn_close": "Fechar",
		"portfolio":{
			"title": "Portfólio",
			"desc": "O projeto a seguir é meu portfólio da web. Desde que terminei o curso da Udemy no VueJS, decidi que estava na hora de usar bem esse conhecimento. Esta foi a minha primeira vez que o projeto foi totalmente desenvolvido no VueJS. Essa também foi a primeira vez que utilizei totalmente um pré-compilador de css (eu já havia usado em um projeto anterior Bom2, mas apenas para minificar, uglificar e adicionar prefixos de navegador ao código css). Dessa vez, eu consegui me ensinar sobre como usar o SASS / SCSS (que é o que eu sempre quis fazer) e entrei rapidamente, pois parecia muito natural. Eu usei a ferramenta Vue CLI 3 para começar rapidamente com algum código padrão, para evitar a sobrecarga inicial de configurar um projeto a partir do zero, é realmente muito mais eficaz começar dessa maneira. <u>Este projeto foi desenvolvido durante 2019, nenhuma lógica de negócios foi implementada, além da função PHP Mailer.</u>",
			"skills": ["PHP Mail", "VueJS","SCSS", "Webpack", "Vue i18N", "Git"]
		},
		"bom2":{
			"title": "Bom&sup2",
			"desc": "Bom2 (lê-se Bom-ao-Quadrado) é um projeto que desenvolvi para um cliente em Portugal. O seu negócio principal consiste em vender um tipo especial de crepe e waffle do seu caminhão de comida, que eles usam para viajar por todo o país, alcançando assim mais pessoas. Inicialmente, eles queriam uma página da Web que fortificasse sua presença on-line. O principal objetivo era, de alguma forma, informar os clientes sobre seus locais anteriores, reais e futuros, para que todos os clientes pudessem encontrá-los facilmente. <br/> Primeiramente, tive a idéia de um carro em movimento, mostrando o progresso da viagem, mas isso não parecia possível depois no caminho do desenvolvimento. Conversamos e chegamos à conclusão de que uma ferramenta simples, porém intuitiva, semelhante a um calendário poderia ser implementada, na qual o cliente poderia inserir pessoalmente as datas de entrada e as coordenadas exatas (longitude e latitude) da página de administração, permitindo assim para que os clientes simplesmente cliquem no evento no calendário da página da Web e sejam redirecionados para o site do Google Maps com uma estrada sugerida (API do Google Maps). Também consegui trabalhar um pouco com a API do Instagram para que eles pudessem escolher quais postagens gostariam de exibir por meio de uma hashtag personalizada, que, apesar de ter se mostrado difícil, já que o token expirava com bastante frequência. Para resolver isso, criei um botão / função especial que permite ao cliente gerar um novo token sempre que o antigo expirar. <br/> A maior parte do código é escrita no ES6 (funções de seta e API de busca), que então usei o Babel em conjunto com o Webpack para transpilar o código para js mais antigos. <u>Este projeto foi desenvolvido no final de 2018 e no início de 2019, com front e back-end. O front-end foi desenvolvido apenas como uma versão móvel.</u>",
			"skills": ["PHP","PHP Mail","JS5/6","HTML/CSS","Webpack","Instagram API", "Google Maps API","Git"]
		},
		"lkproperties":{
			"title": "Lk Properties",
			"desc": "Este projeto foi desenvolvido para um cliente localizado em Portugal, que queria poder lançar imóveis para compra, aluguel e venda. Realizei várias entrevistas com o cliente para reunir todos os requisitos necessários para o projeto. Principalmente, o cliente estava mais interessado em ter uma página de anúncios para que todas as informações necessárias pudessem ser inseridas independentemente. Para que isso fosse realizado, eu havia planejado, projetado e construído o banco de dados de forma que ele fosse flexível e pudesse acomodar vários idiomas (já que esse era outro pedido dos clientes). O cliente também expressou a necessidade de uma funcionalidade \"criar conta\" para os usuários finais. Embora essa funcionalidade seja ótima para implementar, eu recomendo ao cliente que essa implementação seja desnecessária neste momento, pois a interface do usuário permitirá que o cliente entre em contato facilmente no caso de interesse, e que talvez possamos priorizar outras áreas. Esta foi minha primeira vez criando uma página da web em grande escala e também minha primeira vez usando o bootstrap e o git. <u>Este projeto foi desenvolvido em 2018 durante alguns meses e possui front-end e back-end, o que é bastante complexo.</u>",
			"skills": ["PHP","PHP Mail","JS/jQuery","HTML/CSS","Bootstrap","Git"]
		},
		"projekt":{
			"title": "Group Project",
			"desc": "Este foi um projeto de grupo que eu e mais três colegas desenvolvemos no final de nosso primeiro ano de universidade. A idéia era desenvolver uma página da Web onde as pessoas pudessem encontrar facilmente outras pessoas que queriam treinar (seja futebol, academia ou outros tipos de esportes). Desenvolvemos este projeto durante um mês, no qual também tivemos que criar uma apresentação PP do projeto. O projeto tem um front-end e back-end. O front-end foi desenvolvido pela maioria de nós, enquanto o back-end que eu pessoalmente o desenvolvi. Como apenas um outro membro possuía experiência anterior em programação (e nossas ambições eram grandes), tentamos tornar a página o mais funcional possível (em termos de funções oferecidas), ignorando um pouco o design e o layout, pois era principalmente um prova de conceito. Em seguida, apresentamos nosso trabalho à frente de três professores. Durante e após a apresentação, todos os professores ficaram surpresos com a nossa conquista, pois tínhamos quase desenvolvido uma página da web funcional. Além de encontrar pessoas para treinar em tempo real com o jQuery, também conseguimos fazê-lo funcionar para que um usuário pudesse editar suas preferências, enviar solicitações de \"amigos\" e conversar com outras pessoas. <u>Este projeto foi desenvolvido durante o último mês do semestre de 2018.</u>",
			"skills": ["PHP","JS/jQuery","HTML/CSS","Git"]
		},
		"vartan":{
			"title": "Värtan IK - B",
			"desc": "Este foi um projeto de hobby que eu desenvolvi durante o tempo em que jogava futebol para um time de futebol e também era treinador parcial. Eu e outro treinador planejamos nossas sessões de treinamento com base na quantidade de pessoas que participariam dos treinamentos. Às vezes, planejamos um treinamento para 15 pessoas e apenas 8 se juntaram e vice-versa. Foi um pouco frustrante tentar organizar algo sem saber quantas pessoas apareceriam. <br/> Como nem todos em nossa equipe tinham uma conta no Facebook para ingressar em um grupo do Facebook e permitir que os treinadores participassem ou não da sessão de treinamento, tive a ideia de criar uma página da Web simples para que todos os membros de nossa equipe poderiam informar se estavam participando da sessão de treinamento ou não. Por sua vez, isso nos ajudou (treinadores) a planejar melhor nossas sessões de treinamento e até aproveitá-las. <u>Este projeto foi desenvolvido em 2014, possui front-end e back-end.</u>",
			"read_more": "",
			"skills": ["PHP","JS","HTML/CSS","jQuery"]
		}
	},
	"about_me":{
		"menu_title": "Sobre mim",
		"p1": "Sou desenvolvedor independente de idioma. A maioria dos meus projetos foi desenvolvida na pilha da web. Sou rápido em aprender novas tecnologias e idiomas, facilmente adaptável, flexível e tenho uma mentalidade de solução de problemas. Gosto de ficar de olho nas estruturas e ferramentas que eventualmente apoiarão meu fluxo de trabalho de desenvolvimento e, assim, ampliarão meu arsenal de habilidades e conhecimentos.\nA maioria dos projetos de pilha da web em que trabalhei exigiram o desenvolvimento de front-end e back-end.",
		"p2": "Comecei minha jornada de programação no ensino médio e desde então tenho desenvolvido constantemente minhas habilidades.",
		"p3": "No final do meu último ano do ensino médio, consegui um estágio de 3 meses (que fazia parte do currículo do ensino médio) em uma empresa de desenvolvimento web / design / marketing chamada World Wide Design, localizada em Portugal. Eu era um dos três aprendizes naquela época. No momento, estou estudando Desenvolvimento de SI na universidade de Uppsala, Suécia.",
		"p4": "Trabalhei com as seguintes linguagens de programação:",
		"p5": "Trabalhei com as seguintes bibliotecas, frameworks e ferramentas:"
	},
	"contact": {
		"menu_title": "Contacto",
		"menu_text": "Pode-me enviar um email através para: <a class=\"landing-email-link\" href=\"mailto:calexandru2018@pm.me\" target=\"_top\">calexandru2018@pm.me</a>.",
		"contact_form":{
			"confirm_sent": "Enviado",
			"error_sent": "Error ao enviar",
			"send_btn": "Enviar"
		}
	}
}